Res-container-random-v6/container_t_4_c_6_frontCore_1_wrkCore_2/wrk.txt
Running 1m test @ http://128.226.119.92:5000
  4 threads and 6 connections
  Thread calibration: mean lat.: 4974.950ms, rate sampling interval: 17956ms
  Thread calibration: mean lat.: 4964.231ms, rate sampling interval: 17924ms
  Thread calibration: mean lat.: 4938.900ms, rate sampling interval: 17956ms
  Thread calibration: mean lat.: 4954.742ms, rate sampling interval: 17940ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    24.90s    10.57s   43.61s    56.31%
    Req/Sec   145.50      2.00   149.00     87.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   25.59s 
 75.000%   33.82s 
 90.000%   39.88s 
 99.000%   43.61s 
 99.900%   44.40s 
 99.990%   44.60s 
 99.999%   44.60s 
100.000%   44.60s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5779.455     0.000000            1         1.00
   10379.263     0.100000         2909         1.11
   13148.159     0.200000         5797         1.25
   18055.167     0.300000         8717         1.43
   22659.071     0.400000        11598         1.67
   25591.807     0.500000        14495         2.00
   26656.767     0.550000        15945         2.22
   27705.343     0.600000        17407         2.50
   28901.375     0.650000        18867         2.86
   30294.015     0.700000        20306         3.33
   33816.575     0.750000        21756         4.00
   34996.223     0.775000        22481         4.44
   36012.031     0.800000        23204         5.00
   36995.071     0.825000        23928         5.71
   37978.111     0.850000        24634         6.67
   39092.223     0.875000        25394         8.00
   39452.671     0.887500        25723         8.89
   39878.655     0.900000        26087        10.00
   40206.335     0.912500        26476        11.43
   40566.783     0.925000        26815        13.33
   40992.767     0.937500        27200        16.00
   41254.911     0.943750        27361        17.78
   41549.823     0.950000        27542        20.00
   41844.735     0.956250        27716        22.86
   42205.183     0.962500        27937        26.67
   42467.327     0.968750        28077        32.00
   42631.167     0.971875        28175        35.56
   42795.007     0.975000        28276        40.00
   42926.079     0.978125        28364        45.71
   43089.919     0.981250        28449        53.33
   43286.527     0.984375        28539        64.00
   43384.831     0.985938        28575        71.11
   43515.903     0.987500        28649        80.00
   43614.207     0.989062        28703        91.43
   43679.743     0.990625        28715       106.67
   43745.279     0.992188        28756       128.00
   43810.815     0.992969        28787       142.22
   43909.119     0.993750        28825       160.00
   43909.119     0.994531        28825       182.86
   44007.423     0.995313        28848       213.33
   44105.727     0.996094        28884       256.00
   44105.727     0.996484        28884       284.44
   44171.263     0.996875        28892       320.00
   44204.031     0.997266        28912       365.71
   44236.799     0.997656        28916       426.67
   44302.335     0.998047        28936       512.00
   44302.335     0.998242        28936       568.89
   44302.335     0.998437        28936       640.00
   44367.871     0.998633        28944       731.43
   44400.639     0.998828        28953       853.33
   44400.639     0.999023        28953      1024.00
   44466.175     0.999121        28958      1137.78
   44498.943     0.999219        28969      1280.00
   44498.943     0.999316        28969      1462.86
   44498.943     0.999414        28969      1706.67
   44498.943     0.999512        28969      2048.00
   44498.943     0.999561        28969      2275.56
   44564.479     0.999609        28971      2560.00
   44597.247     0.999658        28981      2925.71
   44597.247     1.000000        28981          inf
#[Mean    =    24899.781, StdDeviation   =    10566.584]
#[Max     =    44564.480, Total count    =        28981]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  35123 requests in 1.00m, 14.39MB read
  Socket errors: connect 0, read 0, write 0, timeout 23
Requests/sec:    585.38
Transfer/sec:    245.51KB